export interface HistoryItem {
  date: string; // YYYY-MM-DD 형식
  text: string;
}

export const HISTORY_DATA: HistoryItem[] = [
  // 2025년
  {
    date: "2025-05-13",
    text: "Devkor - 도메인 주도 설계 세미나 강연",
  },
  {
    date: "2025-03-02",
    text: "산학캡스톤디자인 - LLM 기반 Agentic RAG 시스템 설계",
  },
  {
    date: "2025-02-28",
    text: "핸디버스 - v1 런칭 및 월 매출 1억 달성",
  },
  {
    date: "2025-02-15",
    text: "개인 브랜딩 기술 블로그 홈페이지 개발",
  },
  {
    date: "2025-02-01",
    text: "고려대학교 소프트웨어 개발학회 Devkor 운영진 취임",
  },

  // 2024년
  {
    date: "2024-09-01",
    text: "소프트웨어 기술벤처 전공 - 컴퓨터학과 경영학 융합",
  },
  {
    date: "2024-08-01",
    text: "히얼러스 - 팀 조직 및 gRPC, Kafka 기반 MSA 시스템 설계",
  },
  {
    date: "2024-08-01",
    text: "핸디버스 - 아이돌 전문 DRT 스타트업 초기 멤버 입사",
  },
  {
    date: "2024-03-19",
    text: "육군 병장 만기 전역",
  },
  {
    date: "2024-03-04",
    text: "Devkor - 커스텀 특화 블로그 블꾸 백엔드 개발",
  },
  {
    date: "2024-02-01",
    text: "고려대학교 소프트웨어 개발학회 Devkor 입회",
  },

  // 2023년
  {
    date: "2023-08-01",
    text: "국방분야 AI·SW 역량강화 교육 인공지능 과정 수료",
  },
  {
    date: "2023-06-01",
    text: "부대 내 순환 업무 자동화 및 공정성 확보 시스템 개발",
  },
  {
    date: "2023-02-01",
    text: "부대 내 식품 관리 전산 체계 웹 개발 - 정보 관리 및 업무 자동화",
  },
  // 2022년
  {
    date: "2022-04-01",
    text: "서울ICT이노베이션스퀘어 인공지능 교육과정 수료",
  },
  {
    date: "2022-09-01",
    text: "육군 입대",
  },

  // 2021년
  {
    date: "2021-03-01",
    text: "영문학 소모임 LIT 부회장",
  },
  // 2020년
  {
    date: "2020-03-01",
    text: "고려대학교 영어영문학과 입학 및 영어학·자연어 학습",
  },
  {
    date: "2020-04-01",
    text: "영어영문학과 학생회 활동",
  },
  {
    date: "2020-05-01",
    text: "영문학 소모임 LIT 입회",
  },
];
